FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
/*
  XIAO ESP32-S3 PLUS + 0.96 Inch Display
  Factory Dashboard v1.11 - 0.96 small-font IMU field redraw fix + uppercase TAP

  References:
    - 0526_DashBoard_096_nRF52840.ino
    - xiao_esp32s3plus_096_factory_dashboard_v0_1.ino
    - completed XIAO ESP32-S3 PLUS BAT presence/percentage algorithm

  Target:
    0.96 Inch Display Powered by XIAO ESP32-S3 PLUS

  Board difference:
    - LCD: 0.96" ST7789, 80 x 160
    - No touch
    - No SD
    - 2 user buttons: USR1 / USR2
    - IMU INT uses D9 on the 0.96 pin map
    - Backlight is ON/OFF, matching nRF52840 0.96 behavior
    - BAT divider:
        VBAT -- 316K -- ADC(D16) -- 160K -- GND
      This firmware only shows:
        1) whether a real battery is connected
        2) battery percentage when connected
      No charging state is inferred because there is no CHG/STAT/VBUS pin.
*/

#include <Arduino.h>
#include <Wire.h>
#include <WiFi.h>
#include <Arduino_GFX_Library.h>
#include "esp_idf_version.h"
#include <driver/gpio.h>
#include <math.h>

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

// ========================= Build switches =========================

#define LCD_USE_ESP32SPI 1
#define REDUCE_PDM_CLK_DRIVE 1

// ========================= Pins =========================

static constexpr uint8_t MIC_CLK_PIN   = D0;
static constexpr uint8_t MIC_DATA_PIN  = D1;
static constexpr uint8_t LCD_CS_PIN    = D2;
static constexpr uint8_t LCD_DC_PIN    = D3;
static constexpr uint8_t I2C_SDA_PIN   = D4;
static constexpr uint8_t I2C_SCL_PIN   = D5;
static constexpr uint8_t BTN_A_PIN     = D6;   // USR1: backlight ON/OFF
static constexpr uint8_t BTN_B_PIN     = D7;   // USR2: toggle header Hello/Seeed
static constexpr uint8_t LCD_SCK_PIN   = D8;
static constexpr uint8_t IMU_INT_PIN   = D14;   // 0.96: IMU_INT
static constexpr uint8_t LCD_MOSI_PIN  = D10;
static constexpr uint8_t BAT_ADC_PIN   = D16;
static constexpr uint8_t LCD_RST_PIN   = D17;
static constexpr uint8_t LCD_BL_PIN    = D18;

// ========================= Timing =========================

static constexpr uint32_t UI_FAST_MS       = 100;
static constexpr uint32_t UI_SLOW_MS       = 220;
static constexpr uint32_t UI_VU_MS         = 70;
static constexpr uint32_t BAT_REFRESH_MS   = 600;
static constexpr float VSENSE_D16_DELTA_V   = 0.02f;   // redraw only above ADC jitter
static constexpr float VSENSE_CALC_DELTA_V  = 0.05f;   // redraw only above calculated voltage jitter
static constexpr uint32_t SERIAL_MS        = 700;
static constexpr uint32_t BTN_DEBOUNCE_MS  = 18;
static constexpr uint32_t BTN_ACTION_LOCKOUT_MS = 70;
static constexpr uint32_t TAP_DEBOUNCE_MS  = 220;

// ========================= LCD parameters =========================

static constexpr int LCD_W = 80;
static constexpr int LCD_H = 160;
static constexpr int LCD_ROTATION = 2;
static constexpr bool LCD_IPS = true;
static constexpr bool LCD_INVERT_COLORS = true;

// Verified by previous 0.96 bring-up.
static constexpr int LCD_COL_OFFSET_1 = 24;
static constexpr int LCD_ROW_OFFSET_1 = 0;
static constexpr int LCD_COL_OFFSET_2 = 24;
static constexpr int LCD_ROW_OFFSET_2 = 0;

#if LCD_USE_ESP32SPI
Arduino_DataBus *lcdBus = new Arduino_ESP32SPI(
  LCD_DC_PIN,
  LCD_CS_PIN,
  LCD_SCK_PIN,
  LCD_MOSI_PIN
);
#else
Arduino_DataBus *lcdBus = new Arduino_SWSPI(
  LCD_DC_PIN,
  LCD_CS_PIN,
  LCD_SCK_PIN,
  LCD_MOSI_PIN,
  GFX_NOT_DEFINED
);
#endif

Arduino_GFX *gfx = new Arduino_ST7789(
  lcdBus,
  LCD_RST_PIN,
  LCD_ROTATION,
  LCD_IPS,
  LCD_W,
  LCD_H,
  LCD_COL_OFFSET_1,
  LCD_ROW_OFFSET_1,
  LCD_COL_OFFSET_2,
  LCD_ROW_OFFSET_2
);

// ========================= Colors =========================

static constexpr uint16_t C_BLACK   = RGB565_BLACK;
static constexpr uint16_t C_WHITE   = RGB565_WHITE;
static constexpr uint16_t C_GREEN   = RGB565_LIGHTGREEN;
static constexpr uint16_t C_RED     = RGB565_RED;
static constexpr uint16_t C_CYAN    = RGB565_CYAN;
static constexpr uint16_t C_YELLOW  = RGB565_YELLOW;
static constexpr uint16_t C_ORANGE  = 0xFD20;
static constexpr uint16_t C_GRAY    = 0x8410;
static constexpr uint16_t C_LINE    = 0x39E7;
static constexpr uint16_t C_DIM     = 0x2104;
static constexpr uint16_t C_BLUE    = RGB565_BLUE;

// 0.96 panel visual aliases.
// Same convention as nRF52840 0.96 reference: color order appears remapped.
static constexpr uint16_t V_RED     = C_BLUE;
static constexpr uint16_t V_BLUE    = C_RED;
static constexpr uint16_t V_YELLOW  = C_CYAN;
static constexpr uint16_t V_CYAN    = C_YELLOW;
static constexpr uint16_t V_GREEN   = C_GREEN;
static constexpr uint16_t V_WHITE   = C_WHITE;

// ========================= Battery =========================
//
// S3 battery policy:
//   - battery presence + percentage only
//   - no charging inference
//
// Divider:
//   VBAT -- 316K -- ADC -- 160K -- GND
//   ratio = 2.975

static constexpr float BAT_R_TOP_KOHM        = 316.0f;
static constexpr float BAT_R_BOTTOM_KOHM     = 160.0f;
static constexpr float BAT_DIVIDER_RATIO     = (BAT_R_TOP_KOHM + BAT_R_BOTTOM_KOHM) / BAT_R_BOTTOM_KOHM;
static constexpr float BAT_CAL_FACTOR        = 1.000f;

static constexpr float BAT_VALID_MIN_V       = 2.80f;
static constexpr float BAT_VALID_MAX_V       = 4.60f;
static constexpr uint16_t BAT_PRESENT_MIN_MV = 850;
static constexpr uint16_t BAT_FLOAT_RANGE_MV = 90;

static constexpr uint8_t BAT_VALID_CONFIRM_COUNT = 3;
static constexpr uint8_t BAT_INVALID_CONFIRM_COUNT = 3;

// USB-only cold boot guard.
// Observed on 1.47 S3: USB-only can show stable fake ~70%.
static constexpr bool BAT_COLD_BOOT_HIGH_AS_USB = true;
static constexpr int  BAT_COLD_BOOT_SUSPECT_PCT = 60;

// Reject impossible high jump after a known real battery.
static constexpr float BAT_IMPOSSIBLE_JUMP_V     = 0.28f;
static constexpr int   BAT_IMPOSSIBLE_JUMP_PCT   = 22;
static constexpr uint8_t BAT_FLOAT_REJECT_STREAK = 2;

// Reinsert unlock after FLOAT_LOCK.
static constexpr float BAT_REINSERT_DROP_V       = 0.16f;

// USB-first then battery-insert compensation.
static constexpr float BAT_USB_INSERT_SURFACE_COMP_V = 0.085f;
static constexpr float BAT_USB_INSERT_RELEASE_DROP_V = 0.045f;
static constexpr float BAT_EFFECTIVE_MIN_V           = 3.25f;

// UI percentage limiter.
static constexpr uint32_t BAT_PCT_RISE_INTERVAL_MS = 90000;

// ADC sampling.
static constexpr uint8_t BAT_SAMPLE_COUNT = 12;
static constexpr uint16_t BAT_SAMPLE_DELAY_US = 700;

