FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
// ========================= MIC =========================

static constexpr int MIC_SAMPLE_RATE_HZ = 16000;
static constexpr bool MIC_CLK_INVERT = false;
static constexpr size_t MIC_SAMPLES_PER_READ = 256;

#if ESP_IDF_VERSION_MAJOR >= 5
static i2s_chan_handle_t g_i2sRxChan = nullptr;
#else
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;
#endif

int16_t g_pdmBuf[MIC_SAMPLES_PER_READ];

uint32_t g_micPeak = 0;
uint32_t g_micRms = 0;
uint32_t g_micLastUpdateMs = 0;

float g_vuSmooth = 0.0f;
float g_vuFast = 0.0f;
int g_vuDisplaySegments = 0;
int g_cachedVuSegments = -1;
int g_cachedVuWidth = -1;
uint16_t g_cachedVuColor = 0xFFFF;
uint32_t g_lastVuStepMs = 0;

// VU anti-flicker state.
int g_vuCandidateSegments = 0;
uint8_t g_vuCandidateCount = 0;
uint32_t g_lastVuRenderMs = 0;
uint32_t g_vuFallGuardUntilMs = 0;

float g_micNoiseFloor = 65.0f;
bool g_micNoiseReady = false;
uint32_t g_micNoiseStartMs = 0;

// ========================= IMU =========================

enum ImuType {
  IMU_NONE = 0,
  IMU_QMI8658,
  IMU_LSM6DS3
};

ImuType g_imuType = IMU_NONE;
uint8_t g_imuAddr = 0;
bool g_imuOk = false;

float g_ax = 0, g_ay = 0, g_az = 0;
float g_gx = 0, g_gy = 0, g_gz = 0;

volatile bool g_imuIntFlag = false;
bool g_imuTapConfigured = false;
uint32_t g_doubleTapCount = 0;
uint32_t g_lastTapMs = 0;

// ========================= General state =========================

bool g_lcdOk = false;
bool g_micOk = false;
bool g_blOn = true;
bool g_headerSeeed = false;

// Buttons
bool g_btnA = false;
bool g_btnB = false;
int g_btnARaw = HIGH;
int g_btnBRaw = HIGH;

bool g_btnALastRawPressed = false;
bool g_btnBLastRawPressed = false;
uint32_t g_btnALastChangeMs = 0;
uint32_t g_btnBLastChangeMs = 0;

volatile uint8_t g_btnAIrqCount = 0;
volatile uint8_t g_btnBIrqCount = 0;
bool g_btnAPendingAction = false;
bool g_btnBPendingAction = false;
bool g_btnAArmed = true;
bool g_btnBArmed = true;
uint32_t g_btnALastQueueMs = 0;
uint32_t g_btnBLastQueueMs = 0;
uint32_t g_lastBtnActionMs = 0;

// Battery
struct BatteryState {
  uint16_t raw = 0;
  uint16_t rawMin = 0;
  uint16_t rawMax = 0;

  uint16_t mv = 0;
  uint16_t mvMin = 0;
  uint16_t mvMax = 0;
  uint16_t spreadMv = 0;

  float vadc = 0.0f;
  float rawVbat = 0.0f;
  float vbat = 0.0f;
  int percent = 0;

  bool valid = false;
  const char *state = "BOOT";
};

BatteryState g_bat;
BatteryState g_vsense;       // raw D16 ADC measurement before BAT/USB filtering
BatteryState g_lastGoodBat;
bool g_haveLastGoodBat = false;
const char *g_batFilterState = "BOOT";

uint8_t g_batValidStreak = 0;
uint8_t g_batInvalidStreak = 0;

int g_batDisplayPercent = -1;
uint32_t g_batLastPctRiseMs = 0;

bool g_batFloatReject = false;
uint8_t g_batFloatRejectStreak = 0;
uint8_t g_batReinsertStreak = 0;
float g_batLastRealV = 0.0f;
int g_batLastRealPercent = -1;

uint8_t g_batColdUsbSuspectStreak = 0;

bool g_batUsbOnlySeen = false;
bool g_batUsbInsertCompActive = false;
float g_batUsbInsertRawStartV = 0.0f;

// UI timing/cache
uint32_t g_lastFastMs = 0;
uint32_t g_lastSlowMs = 0;
uint32_t g_lastVuMs = 0;
uint32_t g_lastBatMs = 0;
uint32_t g_lastSerialMs = 0;
uint32_t g_frameCounter = 0;

String cache_header = "";
String cache_sys = "";
String cache_bl = "";
float g_d16ShownVadc = -1.0f;
float g_d16ShownCalc = -1.0f;
String cache_acc = "";
String cache_gyr = "";
String cache_tap = "";
String cache_raw = "";
String cache_ax_txt = "";
String cache_ay_txt = "";
String cache_az_txt = "";
String cache_gx_txt = "";
String cache_gy_txt = "";
String cache_gz_txt = "";
bool g_imuTinyLabelsDrawn = false;

// Battery UI snapshot, tiny UI anti-flicker.
bool g_batUiInit = false;
bool g_batUiUsb = true;
bool g_batUiValid = false;
int g_batUiPct = -1;
uint32_t g_lastBatUiCommitMs = 0;

// ========================= UI layout =========================

static constexpr int ROW_TITLE  = 3;
static constexpr int ROW_SUB    = 22;

// Flat compact layout for 80x160: no card borders, only section labels + dividers.
static constexpr int SECTION_X0 = 4;
static constexpr int SECTION_X1 = 75;

static constexpr int Y_SYS_LABEL = 35;
static constexpr int Y_SYS_ROW1  = 47;
static constexpr int Y_SYS_ROW2  = 60;
static constexpr int Y_SYS_DIV   = 70;

static constexpr int Y_MOTION_LABEL = 76;
static constexpr int Y_TAP          = 76;
static constexpr int Y_ACC          = 90;
static constexpr int Y_GYR          = 103;
static constexpr int Y_MOTION_DIV   = 112;

// MIC: title and volume bar on same row, Raw below.
static constexpr int Y_MIC_LABEL = 119;
static constexpr int Y_RAW       = 134;

static constexpr int ROW_FOOT = 151;

static constexpr int VU_X = 33;
static constexpr int VU_Y = Y_MIC_LABEL;
static constexpr int VU_W = 41;
static constexpr int VU_H = 9;
static constexpr int VU_SEG_COUNT = 8;
static constexpr int VU_GAP = 1;
static constexpr int VU_SEG_W = (VU_W - 2 - (VU_SEG_COUNT - 1) * VU_GAP) / VU_SEG_COUNT;

// ========================= Helpers =========================

static int16_t le16(const uint8_t *p) {
  return (int16_t)((uint16_t)p[0] | ((uint16_t)p[1] << 8));
}

static bool i2cWrite8(uint8_t addr, uint8_t reg, uint8_t val) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission() == 0;
}

static bool i2cRead(uint8_t addr, uint8_t reg, uint8_t *buf, size_t len) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;

  size_t got = Wire.requestFrom((int)addr, (int)len);
  if (got != len) return false;

  for (size_t i = 0; i < len; i++) buf[i] = Wire.read();
  return true;
}

static bool i2cRead8(uint8_t addr, uint8_t reg, uint8_t *val) {
  return i2cRead(addr, reg, val, 1);
}

static String padRight(const String &s, int width) {
  String out = s;
  while ((int)out.length() < width) out += ' ';
  if ((int)out.length() > width) out = out.substring(0, width);
  return out;
}

static uint16_t colorByPercent(int pct) {
  if (pct <= 15) return V_RED;
  if (pct <= 35) return V_YELLOW;
  return V_GREEN;
}

static int lipoPercent(float v) {
  struct Point { float v; int p; };
  static const Point table[] = {
    {4.20f, 100}, {4.10f, 90}, {4.00f, 80}, {3.92f, 70}, {3.85f, 60},
    {3.79f, 50}, {3.72f, 40}, {3.66f, 30}, {3.58f, 20}, {3.50f, 10}, {3.30f, 0}
  };

  if (v >= table[0].v) return 100;
  if (v <= table[10].v) return 0;

  for (int i = 0; i < 10; i++) {
    if (v <= table[i].v && v >= table[i + 1].v) {
      float t = (v - table[i + 1].v) / (table[i].v - table[i + 1].v);
      return table[i + 1].p + (int)roundf(t * (table[i].p - table[i + 1].p));
    }
  }

