FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
  return 0;
}

static void acquireForLcd() {
  pinMode(LCD_CS_PIN, OUTPUT);
  digitalWrite(LCD_CS_PIN, HIGH);
  delayMicroseconds(2);
}

static void printTextFixed(int x, int y, uint16_t color, const String &s, int widthChars) {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->setTextSize(1);
  gfx->setTextColor(color, C_BLACK);
  gfx->setCursor(x, y);
  gfx->print(padRight(s, widthChars));
}

static uint16_t tinyGlyph3x5(char ch) {
  // 3x5 bitmap font, bits are row-major.
  // This is used only for the 0.96 footer, where the built-in 5x7 font cannot
  // fit "XIAO ESP32-S3 PLUS" inside 80 px, including lowercase letters in Plus.
  switch (ch) {
    case 'A': return 0b010101111101101;
    case 'C': return 0b111100100100111;
    case 'D': return 0b110101101101110;
    case 'E': return 0b111100110100111;
    case 'I': return 0b111010010010111;
    case 'L': return 0b100100100100111;
    case 'O': return 0b111101101101111;
    case 'P': return 0b110101110100100;
    case 'S': return 0b111100111001111;
    case 'T': return 0b111010010010010;
    case 'U': return 0b101101101101111;
    case 'V': return 0b101101101101010;
    case 'X': return 0b101101010101101;
    case 'a': return 0b000011101101011;
    case 'p': return 0b000110101110100;
    case 'G': return 0b111100101101111;
    case '0': return 0b111101101101111;
    case '1': return 0b010110010010111;
    case '2': return 0b111001111100111;
    case '3': return 0b111001111001111;
    case '4': return 0b101101111001001;
    case '5': return 0b111100111001111;
    case '6': return 0b111100111101111;
    case '7': return 0b111001010010010;
    case '8': return 0b111101111101111;
    case '9': return 0b111101111001111;
    case '.': return 0b000000000000010;
    case '+': return 0b000010111010000;
    case '-': return 0b000000111000000;
    case '|': return 0b010010010010010;
    case 'l': return 0b010010010010011;
    case 's': return 0b111100111001111; // match uppercase S glyph for better readability on 3x5 footer
    case 'u': return 0b000000101101111;
    case ' ': return 0;
    default:  return 0;
  }
}

static void drawTiny3x5Text(int x, int y, const char *s, uint16_t c, uint16_t bg) {
  if (!g_lcdOk) return;

  acquireForLcd();

  int cx = x;
  while (*s) {
    char ch = *s++;
    uint16_t bits = tinyGlyph3x5(ch);

    if (ch == ' ') {
      gfx->fillRect(cx, y, 3, 5, bg);
      cx += 4;
      continue;
    }

    for (int row = 0; row < 5; row++) {
      for (int col = 0; col < 3; col++) {
        int bitIndex = 14 - (row * 3 + col);
        bool on = (bits >> bitIndex) & 0x01;
        gfx->drawPixel(cx + col, y + row, on ? c : bg);
      }
    }
    cx += 4;
  }
}

static void drawTiny3x5Field(int x, int y, const String &s, uint16_t c, uint8_t fieldChars) {
  if (!g_lcdOk) return;

  acquireForLcd();

  int w = fieldChars * 4 - 1;
  gfx->fillRect(x, y, w, 5, C_BLACK);
  drawTiny3x5Text(x, y, s.c_str(), c, C_BLACK);
}

static void drawTinyText(int x, int y, const char *s, uint16_t c) {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->setTextSize(1);
  gfx->setTextColor(c, C_BLACK);
  gfx->setCursor(x, y);
  gfx->print(s);
}

static void cleanScreenEdges() {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->drawFastVLine(0, 0, LCD_H, C_BLACK);
  gfx->drawFastVLine(1, 0, LCD_H, C_BLACK);
  gfx->drawFastHLine(0, 0, LCD_W, C_BLACK);
}

// ========================= Backlight =========================

static void applyBacklight() {
  pinMode(LCD_BL_PIN, OUTPUT);
  digitalWrite(LCD_BL_PIN, g_blOn ? HIGH : LOW);
}

static void toggleBacklight() {
  g_blOn = !g_blOn;
  applyBacklight();
  cache_bl = "";
}

// ========================= Button IRQ / queue =========================

static void queueButtonA(uint32_t now) {
  if (!g_btnAArmed) return;
  if (now - g_btnALastQueueMs < BTN_DEBOUNCE_MS) return;
  g_btnALastQueueMs = now;
  g_btnAPendingAction = true;
  g_btnAArmed = false;
}

static void queueButtonB(uint32_t now) {
  if (!g_btnBArmed) return;
  if (now - g_btnBLastQueueMs < BTN_DEBOUNCE_MS) return;
  g_btnBLastQueueMs = now;
  g_btnBPendingAction = true;
  g_btnBArmed = false;
}

void IRAM_ATTR btnAIrqIsr() {
  if (g_btnAIrqCount < 250) g_btnAIrqCount++;
}

void IRAM_ATTR btnBIrqIsr() {
  if (g_btnBIrqCount < 250) g_btnBIrqCount++;
}

static void updateButtons() {
  uint32_t now = millis();
  uint8_t irqA = 0;
  uint8_t irqB = 0;

  noInterrupts();
  irqA = g_btnAIrqCount;
  irqB = g_btnBIrqCount;
  g_btnAIrqCount = 0;
  g_btnBIrqCount = 0;
  interrupts();

  g_btnARaw = digitalRead(BTN_A_PIN);
  g_btnBRaw = digitalRead(BTN_B_PIN);
  bool rawA = (g_btnARaw == LOW);
  bool rawB = (g_btnBRaw == LOW);

  if (irqA) {
    queueButtonA(now);
    g_btnALastRawPressed = rawA;
    g_btnALastChangeMs = now;
  }
  if (irqB) {
    queueButtonB(now);
    g_btnBLastRawPressed = rawB;
    g_btnBLastChangeMs = now;
  }

  if (rawA != g_btnALastRawPressed) {
    g_btnALastRawPressed = rawA;
    g_btnALastChangeMs = now;
  }
  if (rawB != g_btnBLastRawPressed) {
    g_btnBLastRawPressed = rawB;
    g_btnBLastChangeMs = now;
  }

  if ((now - g_btnALastChangeMs) >= BTN_DEBOUNCE_MS && rawA != g_btnA) {
    bool old = g_btnA;
    g_btnA = rawA;
    if (g_btnA && !old) queueButtonA(now);
  }
  if ((now - g_btnBLastChangeMs) >= BTN_DEBOUNCE_MS && rawB != g_btnB) {
    bool old = g_btnB;
    g_btnB = rawB;
    if (g_btnB && !old) queueButtonB(now);
  }

  if (!rawA && g_btnA && (now - g_btnALastChangeMs) >= BTN_DEBOUNCE_MS) {
    g_btnA = false;
    g_btnAArmed = true;
  }
  if (!rawB && g_btnB && (now - g_btnBLastChangeMs) >= BTN_DEBOUNCE_MS) {
    g_btnB = false;
    g_btnBArmed = true;
  }

  if (!rawA && !g_btnA) g_btnAArmed = true;
  if (!rawB && !g_btnB) g_btnBArmed = true;
}

static void handleButtonActions() {
  if (!g_btnAPendingAction && !g_btnBPendingAction) return;

  uint32_t now = millis();
  if (now - g_lastBtnActionMs < BTN_ACTION_LOCKOUT_MS) return;

  if (g_btnBPendingAction) {
    g_btnBPendingAction = false;
    g_btnAPendingAction = false;

    // USR2: only toggle Hello / Seeed. Do not reset Tap.
    g_headerSeeed = !g_headerSeeed;
    cache_header = "";
    g_lastBtnActionMs = now;

    Serial.println("[BTN] USR2 header Hello/XIAO toggle");
    return;
  }

