FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
    if (g_haveLastGoodBat) {
      effectiveV = g_lastGoodBat.vbat * 0.88f + effectiveV * 0.12f;
    }

    measured.vbat = effectiveV;
    measured.percent = updatePresencePercent(lipoPercent(measured.vbat), freshBattery);

    if (g_batValidStreak >= BAT_VALID_CONFIRM_COUNT) {
      g_bat = measured;
      g_bat.state = g_batUsbInsertCompActive ? "BAT_USB_COMP" : "BAT_PRESENT";
      g_batFilterState = g_bat.state;

      g_lastGoodBat = g_bat;
      g_lastGoodBat.valid = true;
      g_haveLastGoodBat = true;

      g_batLastRealV = g_bat.vbat;
      g_batLastRealPercent = g_bat.percent;

      if (!g_batUsbOnlySeen) {
        g_batUsbInsertCompActive = false;
        g_batUsbInsertRawStartV = 0.0f;
      }
    } else if (g_haveLastGoodBat) {
      g_bat = g_lastGoodBat;
      g_bat.state = "BAT_HOLD";
      g_batFilterState = g_bat.state;
    } else {
      g_bat = measured;
      g_bat.state = "BAT_CAND";
      g_batFilterState = g_bat.state;
    }

    return;
  }

  g_batValidStreak = 0;
  if (g_batInvalidStreak < 255) g_batInvalidStreak++;

  if (!g_batFloatReject && g_haveLastGoodBat && g_batInvalidStreak < BAT_INVALID_CONFIRM_COUNT) {
    g_bat = g_lastGoodBat;
    g_bat.valid = true;
    g_bat.state = "BAT_HOLD";
    g_batFilterState = g_bat.state;
    return;
  }

  markBatteryAbsentLikeUsb(measured, plausible ? "FLOAT" : "USB_PWR");
}

static bool batteryUsbTextMode() {
  return !g_bat.valid;
}

static void updateBatteryUiSnapshot() {
  uint32_t now = millis();

  bool newUsb = batteryUsbTextMode();
  bool newValid = g_bat.valid && !newUsb;
  int newPct = newValid ? constrain(g_bat.percent, 0, 100) : -1;

  if (!g_batUiInit) {
    g_batUiInit = true;
    g_batUiUsb = newUsb;
    g_batUiValid = newValid;
    g_batUiPct = newPct;
    g_lastBatUiCommitMs = now;
    return;
  }

  // USB <-> BAT is a real state transition; update immediately.
  if (newUsb != g_batUiUsb || newValid != g_batUiValid) {
    g_batUiUsb = newUsb;
    g_batUiValid = newValid;
    g_batUiPct = newPct;
    g_lastBatUiCommitMs = now;
    return;
  }

  if (newUsb) {
    return;
  }

  // Percent hysteresis:
  // - ignore +/-1% jitter
  // - commit >=2% every 1.5s
  // - commit >=4% immediately
  int pctDiff = abs(newPct - g_batUiPct);
  if (pctDiff >= 4 || (pctDiff >= 2 && (now - g_lastBatUiCommitMs) > 1500UL)) {
    g_batUiPct = newPct;
    g_lastBatUiCommitMs = now;
  }
}

// ========================= LCD/UI =========================

static bool initLcd() {
  applyBacklight();

#if LCD_USE_ESP32SPI
  bool ok = gfx->begin(40000000);
#else
  bool ok = gfx->begin();
#endif

  if (!ok) {
    g_lcdOk = false;
    Serial.println("[LCD] begin failed");
    return false;
  }

  if (LCD_INVERT_COLORS) {
    gfx->invertDisplay(true);
  }

  gfx->fillScreen(C_BLACK);
  gfx->setTextWrap(false);

  g_lcdOk = true;
  Serial.println("[LCD] OK 0.96 ST7789, flat dashboard UI");
  return true;
}

static void drawSectionLabel(int x, int y, uint16_t color, const char *label) {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->setTextSize(1);
  gfx->setTextColor(color, C_BLACK);
  gfx->setCursor(x, y);
  gfx->print(label);
}

static void drawSectionDivider(int y, uint16_t color) {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->drawFastHLine(SECTION_X0 + 1, y, 70, color);
}

static void drawVuFrame() {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->drawRoundRect(VU_X, VU_Y, VU_W, VU_H, 2, V_GREEN);
}

static void drawHeader() {
  if (!g_lcdOk) return;

  acquireForLcd();
  gfx->fillRect(0, 0, LCD_W, 32, C_BLACK);

  gfx->setTextSize(2);
  gfx->setTextColor(V_GREEN, C_BLACK);
  gfx->setCursor(6, ROW_TITLE);
  gfx->print(g_headerSeeed ? "XIAO" : "Hello");

  gfx->setTextSize(1);
  gfx->setTextColor(V_CYAN, C_BLACK);
  gfx->setCursor(4, ROW_SUB);
  gfx->print("0.96 Display");

  gfx->drawFastHLine(5, 31, 70, V_WHITE);
}

static String voltageD16LineText(float d16) {
  char buf[16];
  snprintf(buf, sizeof(buf), "D16 %.2fV", d16);
  return String(buf);
}

static String voltageCalcLineText(float calc) {
  char buf[18];
  snprintf(buf, sizeof(buf), "Calc %.2fV", calc);
  return String(buf);
}

static void drawBatteryIconTiny(int x, int y, bool valid, int pct) {
  if (!g_lcdOk) return;

  acquireForLcd();

  uint16_t c = valid ? colorByPercent(pct) : V_RED;

  gfx->fillRect(x - 1, y - 1, 15, 10, C_BLACK);
  gfx->drawRect(x, y, 11, 7, valid ? V_WHITE : V_RED);
  gfx->fillRect(x + 11, y + 2, 2, 3, valid ? V_WHITE : V_RED);

  if (!valid) {
    gfx->drawLine(x + 2, y + 1, x + 8, y + 6, V_RED);
    gfx->drawLine(x + 8, y + 1, x + 2, y + 6, V_RED);
    return;
  }

  int fillW = map(constrain(pct, 0, 100), 0, 100, 0, 9);
  if (fillW > 0) {
    gfx->fillRect(x + 1, y + 1, fillW, 5, c);
  }
}

static void drawBatteryRowTiny() {
  if (!g_lcdOk) return;

  float d16Now = (g_d16ShownVadc >= 0.0f) ? g_d16ShownVadc : roundf(g_vsense.vadc * 100.0f) / 100.0f;
  float calcNow = (g_d16ShownCalc >= 0.0f) ? g_d16ShownCalc : roundf(g_vsense.rawVbat * 100.0f) / 100.0f;

  String d16Line = voltageD16LineText(d16Now);
  String calcLine = voltageCalcLineText(calcNow);

  acquireForLcd();

  // Two-line voltage display. Clear the full SYS dynamic area to avoid residue
  // from the previous one-line BAT/USB/D16 layout.
  gfx->fillRect(SECTION_X0, Y_SYS_ROW1 - 2, 72, 21, C_BLACK);

  gfx->setTextSize(1);
  gfx->setTextColor(V_YELLOW, C_BLACK);
  gfx->setCursor(SECTION_X0 + 2, Y_SYS_ROW1);
  gfx->print(d16Line);

  gfx->setTextColor(V_YELLOW, C_BLACK);
  gfx->setCursor(SECTION_X0 + 2, Y_SYS_ROW2);
  gfx->print(calcLine);
}

static void drawStaticLayout() {
  if (!g_lcdOk) return;

  acquireForLcd();
  gfx->fillScreen(C_BLACK);
  cleanScreenEdges();
  drawHeader();

  drawSectionLabel(SECTION_X0 + 1, Y_SYS_LABEL, V_CYAN, "SYSTEM");
  drawSectionDivider(Y_SYS_DIV, V_WHITE);

  drawSectionLabel(SECTION_X0 + 1, Y_MOTION_LABEL, V_YELLOW, "MOTION");
  drawSectionDivider(Y_MOTION_DIV, V_WHITE);

  drawSectionLabel(SECTION_X0 + 1, Y_MIC_LABEL, V_GREEN, "MIC");
  drawVuFrame();

  gfx->drawFastHLine(5, 147, 70, V_WHITE);
  // Full product name rendered with a custom 3x5 footer font.
  // Width: 18 chars * 4 px - 1 = 71 px, fits the 80 px panel.
  acquireForLcd();
  gfx->fillRect(0, ROW_FOOT - 1, LCD_W, 8, C_BLACK);
  drawTiny3x5Text(4, ROW_FOOT + 1, "XIAO ESP32-S3 PLUS", V_YELLOW, C_BLACK);

  cache_header = "";
  cache_sys = "";
  cache_bl = "";
  g_d16ShownVadc = -1.0f;
  g_d16ShownCalc = -1.0f;
  cache_acc = "";
  cache_gyr = "";
  cache_tap = "";
  cache_raw = "";
  cache_ax_txt = "";
  cache_ay_txt = "";
  cache_az_txt = "";
  cache_gx_txt = "";
  cache_gy_txt = "";
  cache_gz_txt = "";
  g_imuTinyLabelsDrawn = false;
  g_cachedVuSegments = -1;
  g_cachedVuWidth = -1;
  g_cachedVuColor = 0xFFFF;
}

// ========================= IMU =========================

