FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
  if (i2s_set_pin(I2S_PORT, &pins) != ESP_OK) return false;
#endif

  g_micOk = true;
  Serial.println("[MIC] OK");
  return true;
}

static bool readMic(size_t *bytesRead, uint32_t timeoutMs) {
  *bytesRead = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
  if (!g_i2sRxChan) return false;
  esp_err_t err = i2s_channel_read(g_i2sRxChan, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#else
  esp_err_t err = i2s_read(I2S_PORT, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#endif

  return (err == ESP_OK && *bytesRead > 0);
}

static void updateMic() {
  if (!g_micOk) return;

  size_t bytesRead = 0;
  if (!readMic(&bytesRead, 2)) return;

  uint32_t count = bytesRead / sizeof(int16_t);
  if (!count) return;

  int64_t sum = 0;
  for (uint32_t i = 0; i < count; i++) {
    sum += g_pdmBuf[i];
  }

  int32_t mean = (int32_t)(sum / count);
  uint32_t peak = 0;
  uint64_t sq = 0;

  for (uint32_t i = 0; i < count; i++) {
    int32_t v = (int32_t)g_pdmBuf[i] - mean;
    uint32_t a = v < 0 ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * a;
  }

  g_micPeak = peak;
  g_micRms = (uint32_t)sqrt((double)sq / count);
  g_micLastUpdateMs = millis();
}

static uint32_t currentMicPeak() {
  uint32_t now = millis();

  if (now - g_micLastUpdateMs > 120) {
    g_micPeak = (uint32_t)(g_micPeak * 0.80f);
    g_micRms = (uint32_t)(g_micRms * 0.80f);
  }

  return g_micPeak;
}

// ========================= VU =========================

static int vuLevelToSegments(float level) {
  if (level <= 0.0f) return 0;

  if (level < 0.12f) return 1;
  if (level < 0.22f) return 2;
  if (level < 0.34f) return 3;
  if (level < 0.48f) return 4;
  if (level < 0.64f) return 5;
  if (level < 0.80f) return 6;
  if (level < 0.93f) return 7;
  return 8;
}

static int debounceVuDesired(int desired, uint32_t now) {
  if (desired == g_vuDisplaySegments) {
    g_vuCandidateSegments = desired;
    g_vuCandidateCount = 0;
    return g_vuDisplaySegments;
  }

  if (desired > g_vuDisplaySegments) {
    if (now < g_vuFallGuardUntilMs && desired <= g_vuDisplaySegments + 1) {
      return g_vuDisplaySegments;
    }
  }

  if (desired < g_vuDisplaySegments) {
    g_vuFallGuardUntilMs = now + 150;
    return desired;
  }

  if (desired != g_vuCandidateSegments) {
    g_vuCandidateSegments = desired;
    g_vuCandidateCount = 1;
  } else if (g_vuCandidateCount < 255) {
    g_vuCandidateCount++;
  }

  if (g_vuCandidateCount >= 2 || desired >= g_vuDisplaySegments + 2) {
    return desired;
  }

  return g_vuDisplaySegments;
}

static uint16_t vuColorForSegment(int i) {
  if (i >= 6) return V_RED;
  if (i >= 4) return V_YELLOW;
  return V_GREEN;
}

static void drawVuBlocks(int segs) {
  if (!g_lcdOk) return;

  acquireForLcd();
  for (int i = 0; i < VU_SEG_COUNT; i++) {
    int x = VU_X + 1 + i * (VU_SEG_W + VU_GAP);
    uint16_t c = (i < segs) ? vuColorForSegment(i) : C_BLACK;
    gfx->fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, c);
  }

  g_cachedVuSegments = segs;
}

static void updateVu() {
  if (!g_lcdOk) return;

  uint16_t peak = currentMicPeak();

  // Same 0.96 compact VU behavior: RMS main source, peak helps attack.
  float metric = (float)g_micRms * 0.82f + (float)peak * 0.012f;
  if (metric < 0.0f) metric = 0.0f;
  if (metric > 240.0f) metric = 240.0f;

  uint32_t now = millis();

  if (!g_micNoiseReady) {
    if (g_micNoiseStartMs == 0) g_micNoiseStartMs = now;
    g_micNoiseFloor = g_micNoiseFloor * 0.84f + metric * 0.16f;
    if (now - g_micNoiseStartMs > 1200UL) g_micNoiseReady = true;
  } else {
    if (metric < g_micNoiseFloor) {
      g_micNoiseFloor = g_micNoiseFloor * 0.84f + metric * 0.16f;
    } else if (metric < g_micNoiseFloor + 5.0f) {
      g_micNoiseFloor = g_micNoiseFloor * 0.992f + metric * 0.008f;
    }
  }

  float signal = metric - g_micNoiseFloor - 26.0f;
  if (signal < 0.0f) signal = 0.0f;

  float target = signal / 108.0f;
  if (target > 1.0f) target = 1.0f;

  if (target > g_vuFast) {
    g_vuFast = g_vuFast * 0.35f + target * 0.65f;
  } else {
    g_vuFast = g_vuFast * 0.22f + target * 0.78f;
  }

  if (g_vuFast > g_vuSmooth) {
    g_vuSmooth = g_vuSmooth * 0.58f + g_vuFast * 0.42f;
  } else {
    g_vuSmooth = g_vuSmooth * 0.34f + g_vuFast * 0.66f;
  }

  if (g_vuSmooth < 0.055f) g_vuSmooth = 0.0f;

  int desired = vuLevelToSegments(g_vuSmooth);
  int next = debounceVuDesired(desired, now);

  if (next == g_cachedVuSegments) return;

  g_vuDisplaySegments = next;
  drawVuBlocks(next);
}

// ========================= UI updates =========================

static String formatTapText(uint32_t count) {
  // 0.96 screen is only 80 px wide.
  // "Tap 10" is 6 chars = 36 px at text size 1.
  // Keep 2-digit values readable and cap 3+ digits to avoid overflow.
  if (count <= 99) return String("TAP ") + String(count);
  return String("T99+");
}

static String fmtAxisInt(float v) {
  int iv = (int)roundf(v);
  if (iv > 99) iv = 99;
  if (iv < -99) iv = -99;
  char buf[6];
  snprintf(buf, sizeof(buf), "%+d", iv);
  return String(buf);
}

static String fmtAxis1Dec(float v) {
  // 0.96 panel width is tight. Clamp to +/-9.9 and use one decimal.
  // This keeps rows like "A 0.0 -0.1 1.0" inside 80 px with the 3x5 font.
  if (v > 9.9f) v = 9.9f;
  if (v < -9.9f) v = -9.9f;
  if (fabsf(v) < 0.05f) v = 0.0f;

  char buf[8];
  snprintf(buf, sizeof(buf), "%.1f", v);
  return String(buf);
}

static String fmtAxis1DecFixed(float v) {
  // Fixed 4-char output: +0.0 / -0.5 / +9.9
  // Fixed length lets the 3x5 renderer overwrite old pixels without clearing
  // the whole line, which removes the visible IMU flicker.
  if (v > 9.9f) v = 9.9f;
  if (v < -9.9f) v = -9.9f;
  if (fabsf(v) < 0.05f) v = 0.0f;

  char buf[8];
  snprintf(buf, sizeof(buf), "%+.1f", v);
  return String(buf);
}

static void updateUiFast() {
  if (!g_lcdOk) return;

  String header = g_headerSeeed ? "XIAO" : "Hello";
  if (header != cache_header) {
    cache_header = header;
    drawHeader();
  }

  float d16Now = roundf(g_vsense.vadc * 100.0f) / 100.0f;
  float calcNow = roundf(g_vsense.rawVbat * 100.0f) / 100.0f;

