FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0708_DashBoard_096_ESP32/0708_DashBoard_096_ESP32.ino
  bool voltageChanged =
    (g_d16ShownVadc < 0.0f) ||
    (g_d16ShownCalc < 0.0f) ||
    (fabsf(d16Now - g_d16ShownVadc) >= VSENSE_D16_DELTA_V) ||
    (fabsf(calcNow - g_d16ShownCalc) >= VSENSE_CALC_DELTA_V);

  if (voltageChanged || cache_sys.length() == 0) {
    g_d16ShownVadc = d16Now;
    g_d16ShownCalc = calcNow;
    cache_sys = voltageD16LineText(d16Now) + String("|") + voltageCalcLineText(calcNow);
    drawBatteryRowTiny();
  }

  String tap = formatTapText(g_doubleTapCount);
  if (tap != cache_tap) {
    cache_tap = tap;
    // Use the 3x5 font so "MOTION" and "TAP" can have a clear space
    // while Tap 10 / Tap 99 still fit inside 80 px.
    acquireForLcd();
    gfx->fillRect(45, Y_TAP, 32, 8, C_BLACK);
    drawTiny3x5Text(48, Y_TAP + 2, tap.c_str(), V_YELLOW, C_BLACK);
  }

  uint16_t peak = currentMicPeak();
  String raw = String("Raw ") + String((unsigned)peak);
  if (raw != cache_raw) {
    cache_raw = raw;
    uint16_t c = V_WHITE;
    if (g_vuDisplaySegments >= 6) c = V_RED;
    else if (g_vuDisplaySegments >= 4) c = V_YELLOW;
    printTextFixed(SECTION_X0 + 1, Y_RAW, c, raw, 10);
  }
}

static void updateUiSlow() {
  if (!g_lcdOk) return;
  cleanScreenEdges();

  if (g_imuOk) {
    if (!g_imuTinyLabelsDrawn) {
      // Clear once after the static layout. Do not draw default 5x7 A/G labels,
      // otherwise they overlap the 3x5 IMU values.
      acquireForLcd();
      gfx->fillRect(SECTION_X0 + 1, Y_ACC, 76, 8, C_BLACK);
      gfx->fillRect(SECTION_X0 + 1, Y_GYR, 76, 8, C_BLACK);
      drawTiny3x5Field(SECTION_X0 + 1, Y_ACC + 1, String("A"), V_YELLOW, 1);
      drawTiny3x5Field(SECTION_X0 + 1, Y_GYR + 1, String("G"), V_YELLOW, 1);
      g_imuTinyLabelsDrawn = true;
      cache_ax_txt = cache_ay_txt = cache_az_txt = "";
      cache_gx_txt = cache_gy_txt = cache_gz_txt = "";
    }

    // Keep the readable spaced small-font format:
    // A 0.0 0.9 -0.2 / G 0.0 0.1 -0.4
    // Each value is redrawn only in its own small field to avoid full-line flicker.
    String axTxt = fmtAxis1Dec(g_ax);
    String ayTxt = fmtAxis1Dec(g_ay);
    String azTxt = fmtAxis1Dec(g_az);
    if (axTxt != cache_ax_txt) {
      cache_ax_txt = axTxt;
      drawTiny3x5Field(14, Y_ACC + 1, axTxt, V_WHITE, 4);
    }
    if (ayTxt != cache_ay_txt) {
      cache_ay_txt = ayTxt;
      drawTiny3x5Field(35, Y_ACC + 1, ayTxt, V_WHITE, 4);
    }
    if (azTxt != cache_az_txt) {
      cache_az_txt = azTxt;
      drawTiny3x5Field(56, Y_ACC + 1, azTxt, V_WHITE, 4);
    }

    String gxTxt = fmtAxis1Dec(g_gx / 10.0f);
    String gyTxt = fmtAxis1Dec(g_gy / 10.0f);
    String gzTxt = fmtAxis1Dec(g_gz / 10.0f);
    if (gxTxt != cache_gx_txt) {
      cache_gx_txt = gxTxt;
      drawTiny3x5Field(14, Y_GYR + 1, gxTxt, V_WHITE, 4);
    }
    if (gyTxt != cache_gy_txt) {
      cache_gy_txt = gyTxt;
      drawTiny3x5Field(35, Y_GYR + 1, gyTxt, V_WHITE, 4);
    }
    if (gzTxt != cache_gz_txt) {
      cache_gz_txt = gzTxt;
      drawTiny3x5Field(56, Y_GYR + 1, gzTxt, V_WHITE, 4);
    }
  } else {
    if (cache_acc != "NOIMU") {
      cache_acc = "NOIMU";
      cache_gyr = "";
      acquireForLcd();
      gfx->fillRect(SECTION_X0 + 1, Y_ACC, 76, 20, C_BLACK);
      drawTiny3x5Text(SECTION_X0 + 1, Y_ACC + 1, "IMU NO", V_RED, C_BLACK);
      g_imuTinyLabelsDrawn = false;
      cache_ax_txt = cache_ay_txt = cache_az_txt = "";
      cache_gx_txt = cache_gy_txt = cache_gz_txt = "";
    }
  }
}

static void printSerialStatus() {
  Serial.print("[DASH096_S3] d16_adc=");
  Serial.print(g_vsense.vadc, 3);
  Serial.print("V calc=");
  Serial.print(g_vsense.rawVbat, 3);
  Serial.print("V raw=");
  Serial.print(g_vsense.raw);
  Serial.print(" mv=");
  Serial.print(g_vsense.mv);
  Serial.print(" spread=");
  Serial.print((unsigned)g_vsense.spreadMv);
  Serial.print(" vstate=");
  Serial.print(g_batFilterState);
  Serial.print(" imu=");
  Serial.print(g_imuOk ? "OK" : "NO");
  Serial.print(" tapCfg=");
  Serial.print(g_imuTapConfigured ? "Y" : "N");
  Serial.print(" tap=");
  Serial.print((unsigned long)g_doubleTapCount);
  Serial.print(" acc=(");
  Serial.print(g_ax, 2);
  Serial.print(",");
  Serial.print(g_ay, 2);
  Serial.print(",");
  Serial.print(g_az, 2);
  Serial.print(") gyr=(");
  Serial.print(g_gx, 2);
  Serial.print(",");
  Serial.print(g_gy, 2);
  Serial.print(",");
  Serial.print(g_gz, 2);
  Serial.print(")");
  Serial.print(" micPeak=");
  Serial.print((unsigned)currentMicPeak());
  Serial.print(" micRms=");
  Serial.print((unsigned long)g_micRms);
  Serial.print(" micFloor=");
  Serial.print(g_micNoiseFloor, 1);
  Serial.print(" vu=");
  Serial.print(g_vuSmooth, 2);
  Serial.print(" fast=");
  Serial.print(g_vuFast, 2);
  Serial.print(" vuSeg=");
  Serial.print(g_vuDisplaySegments);
  Serial.print(" usr1=");
  Serial.print(g_btnA ? "P" : "R");
  Serial.print(" usr2=");
  Serial.print(g_btnB ? "P" : "R");
  Serial.print(" bl=");
  Serial.print(g_blOn ? "ON" : "OFF");
  Serial.print(" frame=");
  Serial.println((unsigned long)g_frameCounter++);
}

// ========================= Arduino =========================

static void printHeader() {
  Serial.println();
  Serial.println("=== XIAO ESP32-S3 PLUS 0.96 Factory Dashboard v1.13.1 D16-two-line-yellow ===");
  Serial.println("[UI] nRF52840 0.96 visual parity");
  Serial.println("[D16] voltage sense display: two-line D16 ADC + calculated external voltage");
  Serial.printf("[LCD] ST7789 %dx%d rotation=%d offset=%d,%d,%d,%d invert=%s bus=%s\n",
                LCD_W, LCD_H, LCD_ROTATION,
                LCD_COL_OFFSET_1, LCD_ROW_OFFSET_1, LCD_COL_OFFSET_2, LCD_ROW_OFFSET_2,
                LCD_INVERT_COLORS ? "Y" : "N",
                LCD_USE_ESP32SPI ? "ESP32SPI" : "SWSPI");
  Serial.printf("[PIN] MIC CLK=D0(%d), DATA=D1(%d)\n", MIC_CLK_PIN, MIC_DATA_PIN);
  Serial.printf("[PIN] LCD CS=D2(%d), DC=D3(%d), SCK=D8(%d), MOSI=D10(%d), RST=D17(%d), BL=D18(%d)\n",
                LCD_CS_PIN, LCD_DC_PIN, LCD_SCK_PIN, LCD_MOSI_PIN, LCD_RST_PIN, LCD_BL_PIN);
  Serial.printf("[PIN] I2C SDA=D4(%d), SCL=D5(%d), IMU_INT=D9(%d), BAT=D16(%d)\n",
                I2C_SDA_PIN, I2C_SCL_PIN, IMU_INT_PIN, BAT_ADC_PIN);
  Serial.printf("[BTN] USR1=D6(%d) BL ON/OFF, USR2=D7(%d) Header toggle\n", BTN_A_PIN, BTN_B_PIN);
}

void setup() {
  Serial.begin(115200);
  delay(800);

  WiFi.mode(WIFI_OFF);
  WiFi.disconnect(true);

